tiborsimon/embedded-tdd-headers/pic/pic12/pic12lf1571_tdd.h
#define PWM1PS2                       522
#define PWM1CLKCON_PS2                523
#define PWM1LDCON                     524
#define PWM1LDCON_LDS0                525
#define PWM1LDS                       526
#define PWM1LDCON_LDS                 527
#define PWM1LDS0                      528
#define PWM1LDCON_LDS1                529
#define PWM1LDS1                      530
#define PWM1LDCON_LDT                 531
#define PWM1LDM                       532
#define PWM1LD                        533
#define PWM1LDCON_LDA                 534
#define PWM1OFCON                     535
#define PWM1OFCON_OFS0                536
#define PWM1OFS                       537
#define PWM1OFCON_OFS                 538
#define PWM1OFS0                      539
#define PWM1OFCON_OFS1                540
#define PWM1OFS1                      541
#define PWM1OFMC                      542
#define PWM1OFCON_OFO                 543
#define PWM1OFM0                      544
#define PWM1OFM                       545
#define PWM1OFCON_OFM0                546
#define PWM1OFCON_OFM                 547
#define PWM1OFM1                      548
#define PWM1OFCON_OFM1                549
#define PWM2PHL_PH                    550
#define PWM2PHL0                      551
#define PWM2PHL                       552
#define PWM2PHL1                      553
#define PWM2PHL2                      554
#define PWM2PHL3                      555
#define PWM2PHL4                      556
#define PWM2PHL5                      557
#define PWM2PHL6                      558
#define PWM2PHL7                      559
#define PWM2PHH0                      560
#define PWM2PHH                       561
#define PWM2PHH_PH                    562
#define PWM2PHH1                      563
#define PWM2PHH2                      564
#define PWM2PHH3                      565
#define PWM2PHH4                      566
#define PWM2PHH5                      567
#define PWM2PHH6                      568
#define PWM2PHH7                      569
#define PWM2DCL_DC                    570
#define PWM2DCL0                      571
#define PWM2DCL                       572
#define PWM2DCL1                      573
#define PWM2DCL2                      574
#define PWM2DCL3                      575
#define PWM2DCL4                      576
#define PWM2DCL5                      577
#define PWM2DCL6                      578
#define PWM2DCL7                      579
#define PWM2DCH0                      580
#define PWM2DCH_DC                    581
#define PWM2DCH                       582
#define PWM2DCH1                      583
#define PWM2DCH2                      584
#define PWM2DCH3                      585
#define PWM2DCH4                      586
#define PWM2DCH5                      587
#define PWM2DCH6                      588
#define PWM2DCH7                      589
#define PWM2PRL0                      590
#define PWM2PRL_PR                    591
#define PWM2PRL                       592
#define PWM2PRL1                      593
#define PWM2PRL2                      594
#define PWM2PRL3                      595
#define PWM2PRL4                      596
#define PWM2PRL5                      597
#define PWM2PRL6                      598
#define PWM2PRL7                      599
#define PWM2PRH0                      600
#define PWM2PRH                       601
#define PWM2PRH_PR                    602
#define PWM2PRH1                      603
#define PWM2PRH2                      604
#define PWM2PRH3                      605
#define PWM2PRH4                      606
#define PWM2PRH5                      607
#define PWM2PRH6                      608
#define PWM2PRH7                      609
#define PWM2OFL                       610
#define PWM2OFL_OF                    611
#define PWM2OFL0                      612
#define PWM2OFL1                      613
#define PWM2OFL2                      614
#define PWM2OFL3                      615
#define PWM2OFL4                      616
#define PWM2OFL5                      617
#define PWM2OFL6                      618
#define PWM2OFL7                      619
#define PWM2OFH                       620
#define PWM2OFH0                      621
#define PWM2OFH_OF                    622
#define PWM2OFH1                      623
#define PWM2OFH2                      624
#define PWM2OFH3                      625
#define PWM2OFH4                      626
#define PWM2OFH5                      627
#define PWM2OFH6                      628
#define PWM2OFH7                      629
#define PWM2TMRL_TMR                  630
#define PWM2TMRL0                     631
#define PWM2TMRL                      632
#define PWM2TMRL1                     633
#define PWM2TMRL2                     634
#define PWM2TMRL3                     635
#define PWM2TMRL4                     636
#define PWM2TMRL5                     637
#define PWM2TMRL6                     638
#define PWM2TMRL7                     639
#define PWM2TMRH_TMR                  640
#define PWM2TMRH                      641
#define PWM2TMRH0                     642
#define PWM2TMRH1                     643
#define PWM2TMRH2                     644
#define PWM2TMRH3                     645
#define PWM2TMRH4                     646
#define PWM2TMRH5                     647
#define PWM2TMRH6                     648
#define PWM2TMRH7                     649
#define PWM2CON                       650
#define PWM2MODE0                     651
#define PWM2MODE                      652
#define PWM2CON_MODE0                 653
#define PWM2CON_MODE                  654
#define PWM2MODE1                     655
#define PWM2CON_MODE1                 656
#define PWM2POL                       657
#define PWM2CON_POL                   658
#define PWM2CON_OUT                   659
#define PWM2OUT                       660
#define PWM2OE                        661
#define PWM2CON_OE                    662
#define PWM2EN                        663
#define PWM2CON_EN                    664
#define PWM2INTE                      665
#define PWM2INTE_PRIE                 666
#define PWM2PRIE                      667
#define PWM2INTE_DCIE                 668
#define PWM2DCIE                      669
#define PWM2INTE_PHIE                 670
#define PWM2PHIE                      671
#define PWM2INTE_OFIE                 672
#define PWM2OFIE                      673
#define PWM2INTF                      674
#define PWM2INTF_PRIF                 675
#define PWM2PRIF                      676
#define PWM2INTF_DCIF                 677
#define PWM2DCIF                      678
#define PWM2INTF_PHIF                 679
#define PWM2PHIF                      680
#define PWM2INTF_OFIF                 681
#define PWM2OFIF                      682
#define PWM2CLKCON                    683
#define PWM2CS0                       684
#define PWM2CS                        685
#define PWM2CLKCON_CS0                686
#define PWM2CLKCON_CS                 687
#define PWM2CLKCON_CS1                688
#define PWM2CS1                       689
#define PWM2CLKCON_PS                 690
#define PWM2CLKCON_PS0                691
#define PWM2PS0                       692
#define PWM2PS                        693
#define PWM2PS1                       694
#define PWM2CLKCON_PS1                695
#define PWM2PS2                       696
#define PWM2CLKCON_PS2                697
#define PWM2LDCON                     698
#define PWM2LDCON_LDS0                699
#define PWM2LDS0                      700
#define PWM2LDCON_LDS                 701
#define PWM2LDS                       702
#define PWM2LDS1                      703
#define PWM2LDCON_LDS1                704
#define PWM2LDM                       705
#define PWM2LDCON_LDT                 706
#define PWM2LD                        707
#define PWM2LDCON_LDA                 708
#define PWM2OFCON                     709
#define PWM2OFS                       710
#define PWM2OFS0                      711
#define PWM2OFCON_OFS0                712
#define PWM2OFCON_OFS                 713
#define PWM2OFCON_OFS1                714
#define PWM2OFS1                      715
#define PWM2OFMC                      716
#define PWM2OFCON_OFO                 717
#define PWM2OFCON_OFM0                718
#define PWM2OFM                       719
#define PWM2OFCON_OFM                 720
#define PWM2OFM0                      721
#define PWM2OFCON_OFM1                722
#define PWM2OFM1                      723
#define PWM3PHL                       724
#define PWM3PHL_PH                    725
#define PWM3PHL0                      726
#define PWM3PHL1                      727
#define PWM3PHL2                      728
#define PWM3PHL3                      729
#define PWM3PHL4                      730
#define PWM3PHL5                      731
#define PWM3PHL6                      732
#define PWM3PHL7                      733
#define PWM3PHH0                      734
#define PWM3PHH                       735
#define PWM3PHH_PH                    736
#define PWM3PHH1                      737
#define PWM3PHH2                      738
#define PWM3PHH3                      739
#define PWM3PHH4                      740
#define PWM3PHH5                      741
#define PWM3PHH6                      742
#define PWM3PHH7                      743
#define PWM3DCL_DC                    744
#define PWM3DCL0                      745
#define PWM3DCL                       746
#define PWM3DCL1                      747
#define PWM3DCL2                      748
#define PWM3DCL3                      749
#define PWM3DCL4                      750
#define PWM3DCL5                      751
#define PWM3DCL6                      752
#define PWM3DCL7                      753
#define PWM3DCH_DC                    754
#define PWM3DCH0                      755
#define PWM3DCH                       756
#define PWM3DCH1                      757
#define PWM3DCH2                      758
#define PWM3DCH3                      759
#define PWM3DCH4                      760
#define PWM3DCH5                      761
#define PWM3DCH6                      762
#define PWM3DCH7                      763
#define PWM3PRL0                      764
#define PWM3PRL                       765
#define PWM3PRL_PR                    766
#define PWM3PRL1                      767
#define PWM3PRL2                      768
#define PWM3PRL3                      769
#define PWM3PRL4                      770
#define PWM3PRL5                      771
#define PWM3PRL6                      772
#define PWM3PRL7                      773
#define PWM3PRH0                      774
#define PWM3PRH_PR                    775
#define PWM3PRH                       776
#define PWM3PRH1                      777
#define PWM3PRH2                      778
#define PWM3PRH3                      779
#define PWM3PRH4                      780
#define PWM3PRH5                      781
#define PWM3PRH6                      782
#define PWM3PRH7                      783
#define PWM3OFL_OF                    784
#define PWM3OFL0                      785
#define PWM3OFL                       786
#define PWM3OFL1                      787
#define PWM3OFL2                      788
#define PWM3OFL3                      789
#define PWM3OFL4                      790
#define PWM3OFL5                      791
#define PWM3OFL6                      792
#define PWM3OFL7                      793
#define PWM3OFH_OF                    794
#define PWM3OFH0                      795
#define PWM3OFH                       796
#define PWM3OFH1                      797
#define PWM3OFH2                      798
#define PWM3OFH3                      799
#define PWM3OFH4                      800
#define PWM3OFH5                      801
#define PWM3OFH6                      802
#define PWM3OFH7                      803
#define PWM3TMRL0                     804
#define PWM3TMRL                      805
#define PWM3TMRL_TMR                  806
#define PWM3TMRL1                     807
#define PWM3TMRL2                     808
#define PWM3TMRL3                     809
#define PWM3TMRL4                     810
#define PWM3TMRL5                     811
#define PWM3TMRL6                     812
#define PWM3TMRL7                     813
#define PWM3TMRH0                     814
#define PWM3TMRH_TMR                  815
#define PWM3TMRH                      816
#define PWM3TMRH1                     817
#define PWM3TMRH2                     818
#define PWM3TMRH3                     819
#define PWM3TMRH4                     820
#define PWM3TMRH5                     821
#define PWM3TMRH6                     822
#define PWM3TMRH7                     823
#define PWM3CON                       824
#define PWM3CON_MODE0                 825
#define PWM3MODE                      826
#define PWM3CON_MODE                  827
#define PWM3MODE0                     828
#define PWM3CON_MODE1                 829
#define PWM3MODE1                     830
#define PWM3CON_POL                   831
#define PWM3POL                       832
#define PWM3CON_OUT                   833
#define PWM3OUT                       834
#define PWM3OE                        835
#define PWM3CON_OE                    836
#define PWM3EN                        837
#define PWM3CON_EN                    838
#define PWM3INTE                      839
#define PWM3PRIE                      840
#define PWM3INTE_PRIE                 841
#define PWM3INTE_DCIE                 842
#define PWM3DCIE                      843
#define PWM3PHIE                      844
#define PWM3INTE_PHIE                 845
#define PWM3INTE_OFIE                 846
#define PWM3OFIE                      847
#define PWM3INTF                      848
#define PWM3PRIF                      849
#define PWM3INTF_PRIF                 850
#define PWM3INTF_DCIF                 851
#define PWM3DCIF                      852
#define PWM3INTF_PHIF                 853
#define PWM3PHIF                      854
#define PWM3INTF_OFIF                 855
#define PWM3OFIF                      856
#define PWM3CLKCON                    857
#define PWM3CLKCON_CS                 858
#define PWM3CS                        859
#define PWM3CS0                       860
#define PWM3CLKCON_CS0                861
#define PWM3CS1                       862
#define PWM3CLKCON_CS1                863
#define PWM3PS0                       864
#define PWM3CLKCON_PS                 865
#define PWM3CLKCON_PS0                866
#define PWM3PS                        867
#define PWM3PS1                       868
#define PWM3CLKCON_PS1                869
#define PWM3PS2                       870
#define PWM3CLKCON_PS2                871
#define PWM3LDCON                     872
#define PWM3LDCON_LDS                 873
#define PWM3LDS0                      874
#define PWM3LDS                       875
#define PWM3LDCON_LDS0                876
#define PWM3LDS1                      877
#define PWM3LDCON_LDS1                878
#define PWM3LDCON_LDT                 879
#define PWM3LDM                       880
#define PWM3LDCON_LDA                 881
#define PWM3LD                        882
#define PWM3OFCON                     883
#define PWM3OFS                       884
#define PWM3OFCON_OFS0                885
#define PWM3OFS0                      886
#define PWM3OFCON_OFS                 887
#define PWM3OFCON_OFS1                888
#define PWM3OFS1                      889
#define PWM3OFMC                      890
#define PWM3OFCON_OFO                 891
#define PWM3OFM0                      892
#define PWM3OFCON_OFM0                893
#define PWM3OFCON_OFM                 894
#define PWM3OFM                       895
#define PWM3OFM1                      896
#define PWM3OFCON_OFM1                897
#define STATUS_SHAD                   898
#define C_SHAD                        899
#define DC_SHAD                       900
#define Z_SHAD                        901
#define WREG_SHAD                     902
#define BSR_SHAD                      903
#define PCLATH_SHAD                   904
#define FSR0L_SHAD                    905
#define FSR0H_SHAD                    906
#define FSR1L_SHAD                    907
#define FSR1H_SHAD                    908
#define STKPTR                        909
#define TOSL                          910
#define TOSH                          911

#endif // _PIC12LF1571_H_
